Repository: RPMTW/RPMTW-Wiki
Catalog: lib/l10n/app_*.arb
Languages: ja, ru, uk, zh_hans_cn, zh_hant_hk

# addModBaseCheckExists
source: Check if the mod already exists
ja: Modが既に存在するか確認してください
ru: Проверьте, существует ли уже данный mod
uk: Перевірте, чи мод вже існує
zh_hans_cn: 检查模组是否已经存在
zh_hant_hk: 檢查 Mod 是否已存在

# addModBaseCheckExistsHint
source: Mod Name or Mod ID
ja: Mod名またはMod ID
ru: Имя mod или ID mod
uk: Ім'я мода або ID мода
zh_hans_cn: 模组名称或模组 ID
zh_hant_hk: Mod 名稱或Mod ID

# addModBaseImageRemove
source: Remove image
ja: 画像を削除
ru: Удалить изображение обложки
uk: Видалити зображення
zh_hans_cn: 移除封面图
zh_hant_hk: 刪除封面圖

# addModBaseImageTitle
source: Mod image
ja: Modの画像
ru: Обложка мода
uk: Зображення мода
zh_hans_cn: 模組封面图
zh_hant_hk: Mod 封面圖

# addModBaseImageUpload
source: Upload image
ja: 画像をアップロード
ru: Загрузить изображение
uk: Завантажити зображення
zh_hans_cn: 上传封面图
zh_hant_hk: 上傳封面圖

# addModBaseTitle
source: Basic info
ja: 基本情報
ru: Основная информация
uk: Основна інформація
zh_hans_cn: 基本信息
zh_hant_hk: 基礎信息

# addModCreateBrowse
source: Browse this mod
ja: このModを参照する
ru: Добавить мод
uk: Переглянути цей мод
zh_hans_cn: 浏览此 Mod
zh_hant_hk: 瀏覽此模組

# addModCreateSuccess
source: Mod created successfully!
ja: Modを正常に作成しました!
ru: Mod создан успешно!
uk: Мод створений успішно!
zh_hans_cn: 模组创建成功!
zh_hant_hk: Mod 創建成功！

# addModDescriptionField
source: Mod description
ja: Modの説明
ru: Описание мода
uk: Опис мода
zh_hans_cn: Mod 描述
zh_hant_hk: Mod 描述

# addModDescriptionTooltip
source: Please give a brief description of this mod.
ja: このModについて簡単に説明してください。
ru: Пожалуйста, дайте краткое описание мода.
uk: Будь ласка, дайте короткий опис цього мода.
zh_hans_cn: 请简单扼要的叙述这个Mod。
zh_hant_hk: 請簡要描述吓呢個 Mod。

# addModDetailedCurseForgeField
source: CurseForge Project ID
ru: CurseForge ID проекта
uk: ID проєкту CurseForge
zh_hant_hk: CurseForge 專案 ID

# addModDetailedCurseForgeHint
source: Example: 461500
ja: 例：461500
ru: Например:461500
uk: Наприклад: 461500
zh_hans_cn: 示例： 461500
zh_hant_hk: 示例：461500

# addModDetailedEnvironment
source: Runtime Environment
ja: 実行の環境
ru: Среда выполнения
uk: Середовище виконання
zh_hans_cn: 运行环境
zh_hant_hk: 運行環境

# addModDetailedIntegration
source: Integration Platform
ja: 統合プラットフォーム
ru: Платформа интеграции
uk: Інтеграційна платформа
zh_hans_cn: 集成平台
zh_hant_hk: 整合平台

# addModDetailedModrinthField
source: Modrinth Project ID
ru: Modrinth ID проекта
zh_hant_hk: Modrinth 專案 ID

# addModDetailedModrinthHint
source: Example: ZukQzaRP
ja: 例：ZukQzaRP
ru: Например:ZukQzaRP
uk: Наприклад: ZukQzaRP
zh_hans_cn: 示例：ZukQzaRP
zh_hant_hk: 示例：ZukQzaRP

# addModDetailedRelation
source: Relation mod
ja: 関連Mod
ru: Родственный mod
zh_hans_cn: 关联模组
zh_hant_hk: 關係 Mod

# addModDetailedRelationAdd
source: Add relation mod
ja: 関連Modを追加
ru: Добавить Родственный mod
zh_hans_cn: 添加关联模组
zh_hant_hk: 添加關係 Mod

# addModDetailedRelationCondition
source: Relation condition
ja: 関連条件
ru: Условия объединения
zh_hans_cn: 关联条件
zh_hant_hk: 關係條件

# addModDetailedRelationConditionCommon
source: Common
ja: 共通
ru: Общий
zh_hans_cn: 通用
zh_hant_hk: 通用

# addModDetailedRelationConflict
source: Conflict
ja: 競合
ru: Конфликтный mod
zh_hans_cn: 冲突模组
zh_hant_hk: 衝突模組

# addModDetailedRelationDependency
source: Dependency
ja: 依存関係
ru: Зависимость
zh_hans_cn: 前置模组
zh_hant_hk: 前置 Mod

# addModDetailedRelationHelper
source: This related mod applies to which version of the condition, if not filled in, it means common. example: 1.16.5 ~ 1.18.1,fabric (i.e. for Fabric versions 1.16.5 to 1.18.1 game versions)
ja: この関連するmodは、条件のどのバージョンに適用されますか。入力されていない場合は、共通を意味します。 例：1.16.5 ~ 1.18.1,fabric（つまり、Fabricバージョン1.16.5から1.18.1ゲームバージョンの場合）
ru: Условие, к какой версии применяется данный связанный mod; если оставить пустым, означает общий. Пример. 1.16.5 ~ 1.18.1,fabric (т.е. для версий игры fabric от 1.16.5 до 1.18.1).
zh_hans_cn: 这个相关的模组适用于条件的哪个版本，如果不填写，则表示通用。 示例：1.16.5 ~ 1.18.1,fabric（即对于Fabric版本1.16.5至1.18.1游戏版本）
zh_hant_hk: 呢個相關嘅 Mod 適用於條件嘅邊個版本，如果唔填寫，則表示通用。 示例：1.16.5 ~ 1.18.1,fabric（即對於 Fabric 版本 1.16.5 到 1.18.1 遊戲版本）

# addModDetailedRelationInfo
source: Relation mod info
ja: 関連Modの情報
ru: Информация об ассоциированном mod
zh_hans_cn: 关联模组信息
zh_hant_hk: 關係 Mod 資訊

# addModDetailedRelationIntegration
source: Integration
ja: 統合
ru: Интеграция
zh_hans_cn: 集成
zh_hant_hk: 整合

# addModDetailedRelationMenu
source: Please select the mod you want to relation to
ja: 関連したいModを選択してください
ru: Пожалуйста, выберите мод, информацию о котором вы хотите посмотреть
zh_hans_cn: 请选择您想要关联的模组
zh_hant_hk: 請選擇你要與之相關嘅 Mod

# addModDetailedRelationOther
source: Other
ja: その他
ru: Другое
zh_hans_cn: 其他
zh_hant_hk: 其他

# addModDetailedRelationReforged
source: Reforged
ja: リフォージ済み
ru: Ремастер мода
zh_hans_cn: 重制模组
zh_hant_hk: 重製 Mod

# addModDetailedRelationType
source: Relation mod type
ja: 関連Modのタイプ
ru: Похожие моды
zh_hans_cn: 关联模组类型
zh_hant_hk: 關係 Mod 類型

# addModDetailedTitle
source: Detailed info
ja: 詳しい情報
ru: Подробная информация
zh_hans_cn: 详细信息
zh_hant_hk: 詳細資訊

# addModIdHintText
source: Example: jei
ja: 例：jei
ru: Пример: jei
zh_hans_cn: 示例：jei
zh_hant_hk: 示例：jei

# addModIdTooltip
source: Letter case sensitive, Mod id is usually placed in mcmod.info/mods.toml/fabric.mod.json in the Mod file, so don't fill it in if it's not clear.
ja: 大文字と小文字が区別され、Mod IDは通常Modファイルのmcmod.info/mods.toml/fabric.mod.jsonに配置されるため、明確でない場合は入力しないでください。
ru: Пожалуйста, внимательно разделите размер. Идентификаторы модов обычно размещаются в mcmod.info/mods.toml/fabric.mod.json в файле мода, так что если вы не уверены, не заполняйте их. (fabric).
zh_hans_cn: 请细分大小写，Mod id 通常会放在Mod档案内的 mcmod.info/mods.toml/fabric.mod.json 中，如果不清楚则不要填写。
zh_hant_hk: 字母區分大小寫，Mod ID 通常放喺 Mod 檔案中嘅 mcmod.info/mods.toml/fabric.mod.json 中，因此如果不清楚，請勿填寫。

# addModIntroductionMarkdown
source: RPMWiki support for Github Markdown syntax
ja: Github Markdown構文のRPMWikiサポート
ru: RPMWiki поддерживает синтаксис Github Markdown
zh_hans_cn: RPMWiki 支持 Github Markdown 语法
zh_hant_hk: RPMWiki 支援 Github Markdown 語法

# addModIntroductionOriginal
source: Original Article
ja: 元の記事
ru: Оригинальная статья
zh_hans_cn: 原始文章
zh_hant_hk: 原始文章

# addModIntroductionPreview
source: Preview Article
ja: 記事のプレビュー
ru: Статья для предварительного просмотра
zh_hans_cn: 预览文章
zh_hant_hk: 預覽文章

# addModIntroductionTitle
source: Introduction
ja: 紹介
ru: Презентация
zh_hans_cn: 介绍
zh_hant_hk: 介紹

# addModLoader
source: Mod Loader
ja: Modローダー
ru: mod Loader Например, (версия forge) или (версия fabric).
zh_hans_cn: Mod载入器
zh_hant_hk: Mod 載入器

# addModOriginalNameField
source: Mod name (original)
ja: Mod名 (オリジナル)
ru: mod модификатора (sic)[Пожалуйста, напишите имя на английском языке]
zh_hans_cn: Mod 名称（原文）
zh_hant_hk: Mod 名稱 （原文）

# addModOriginalNameHintText
source: Example: Just Enough Items (JEI)
ja: 例：Just Enough Items (JEI)
ru: Пример：Just Enough Items (JEI)
zh_hans_cn: 示例： Just Enough Items (JEI)
zh_hant_hk: 示例：Just Enough Items (JEI)

# addModOriginalNameValidator
source: The mod name must not be empty.
ja: Mod名は空であってはなりません。
ru: Имя mod не может быть пустым
zh_hans_cn: 模组名不能为空。
zh_hant_hk: Mod 名稱不得為空。

# addModSubmit
source: Submit mod
ja: Modを送信
ru: Отправить mod
zh_hans_cn: 提交模组
zh_hant_hk: 提交 Mod

# addModSubmitTooltip
source: Submit this mod to RPMWiki.
ja: このModをRPMWikiに送信します。
ru: Отправить этот модуль в RPMWiki
zh_hans_cn: 提交此模组到 RPMWiki
zh_hant_hk: 提交此 Mod 至 RPMWiki。

# addModSupportedVersionField
source: Supported Minecraft game versions
ja: サポートされているMinecraftゲームバージョン
ru: Список поддерживаемых версий Minecraft
zh_hans_cn: 支持的 Minecraft 游戏版本
zh_hant_hk: 支援嘅Minecraft遊戲版本

# addModSupportedVersionHint
source: Please select the version...
ja: バージョンを選択してください...
ru: Пожалуйста, выберите другую версию Minecraft...
zh_hans_cn: 请选择版本...
zh_hant_hk: 請選擇版本...

# addModSupportedVersionNull
source: Please select the version of Minecraft supported by this mod.
ja: このModでサポートされているMinecraftのバージョンを選択してください。
ru: Пожалуйста, выберите версию Minecraft, поддерживаемую этим mod .
zh_hans_cn: 请选择此Mod支持的Minecraft版本。
zh_hant_hk: 請選擇此 Mod 支援嘅 Minecraft 版本。

# addModTitle
source: Added Mod
ja: Modを追加
ru: Новый mod
zh_hans_cn: 新增 Mod
zh_hant_hk: 新增 Mod

# addModTranslatedNameField
source: Mod name (translated)
ja: Mod名 (翻訳済み)
ru: Название мода (перевод)[Если официальный перевод на русский язык отсутствует, выберите оригинальное английское название mod]
zh_hans_cn: Mod 名称（已翻译）
zh_hant_hk: Mod 名稱 （已翻譯）

# addModTranslatedNameHintText
source: Example: JEI 物品管理器
ja: 例：JEI アイテムマネージャー
ru: Пример: Конфигурация JEI
zh_hans_cn: 示例：JEI 物品管理器
zh_hant_hk: 範例：JEI 物品管理器

# addModTranslatedNameTooltip
source: The translated mod name, or leave it blank if there is no translation.
ja: 翻訳されたMod名、または翻訳がない場合は空白のままにします。
ru: Переведенные имена mod, или оставьте пустым, если перевод отсутствует.
zh_hans_cn: 已翻译过的模组名称，如果没有译名则请留空。
zh_hant_hk: 已翻譯嘅 Mod 名稱，如果冇翻譯，則將其留空。

# addModVerificationCode
source: Photo Verification Code:
ja: 画像の認証コード:
ru: Код проверки изображения:
zh_hans_cn: 图片验证码：
zh_hant_hk: 圖片驗證碼：

# addModVerificationCodeInput
source: Please follow the above picture to enter the verification code...
ja: 上記の画像に従って認証コードを入力してください...
ru: Пожалуйста, следуйте приведенной выше картинке, чтобы ввести проверочный код...
zh_hans_cn: 请按照上图输入验证码...
zh_hant_hk: 請按照上圖輸入驗證碼...

# addModVerificationCodeRegenerate
source: Click me to regenerate the verification code.
ja: 認証コードを再生成するには、ここをクリックしてください。
ru: Нажмите кнопку Я для повторной генерации проверочного кода.
zh_hans_cn: 点击我重新生成验证码。
zh_hant_hk: 單擊我以重新生成驗證碼。

# addModVerificationCodeWrong
source: The verification code is wrong, please re-enter it again.
ja: 認証コードが正しくありません。もう一度入力してください。
ru: Код проверки неверен, пожалуйста, введите его еще раз.
zh_hans_cn: 验证码错误，请重新输入。
zh_hant_hk: 驗證碼有誤，請重新輸入。

# authLogIn
source: LogIn Account
ja: ログインアカウント
ru: Вход в учетную запись
zh_hans_cn: 登入账户
zh_hant_hk: 登入帳户

# authLogInIng
source: Account information is being processed...
ja: アカウント情報を処理しています...
ru: Информация о счете обрабатывается...
zh_hans_cn: 正在处理账户资料中...
zh_hant_hk: 正在處理帳户資訊...

# authLogout
source: Logout Account
ja: アカウントからログアウト
ru: Выход из учетной записи
zh_hans_cn: 登出账户
zh_hant_hk: 登出帳户

# authManage
source: Management Account
ja: アカウントの管理
ru: Управленческий счет
zh_hans_cn: 管理账户
zh_hant_hk: 管理帳户

# authSuccess
source: Successfully logged into the RPMTW account.
ja: RPMTWアカウントに正常にログインしました。
ru: Успешный вход в учетную запись RPMTW.
zh_hans_cn: 成功登入 RPMTW 账户。
zh_hant_hk: 成功登入 RPMTW 帳户。

# editorToolbarBold
source: Bold
ja: 太字
ru: Смелый
zh_hans_cn: 粗体
zh_hant_hk: 粗體

# editorToolbarClear
source: Clear
ja: 削除
ru: Очистка
zh_hans_cn: 清除
zh_hant_hk: 清除

# editorToolbarCode
source: Code
ja: コードエリア
ru: Код
zh_hans_cn: 代码区块
zh_hant_hk: 代碼方塊

# editorToolbarHeading
source: Heading
ja: ヘッディング
ru: Направление
zh_hans_cn: 标题
zh_hant_hk: 標題

# editorToolbarImage
source: Image
ja: 画像
ru: Изображение
zh_hans_cn: 图片
zh_hant_hk: 圖片

# editorToolbarItalic
source: Italic
ja: イタリック
ru: Курсив
zh_hans_cn: 斜体
zh_hant_hk: 斜體

# editorToolbarLink
source: Link
ja: リンク
ru: Ссылка
zh_hans_cn: 链接
zh_hant_hk: 連結

# editorToolbarList
source: List
ja: リスト
ru: Список
zh_hans_cn: 列表
zh_hant_hk: 列表

# editorToolbarQuote
source: Quote
ja: 引用
ru: Цитата
zh_hans_cn: 引用
zh_hant_hk: 引用

# editorToolbarRedo
source: Redo
ja: 再度実行
ru: Будьте готовы
zh_hans_cn: 重做
zh_hant_hk: 取消復原

# editorToolbarStrikethrough
source: Strikethrough
ja: 取り消し線
ru: Зачеркивание
zh_hans_cn: 删除线
zh_hant_hk: 刪除線

# editorToolbarUnderline
source: Underline
ja: アンダーライン
ru: Подчеркните
zh_hans_cn: 下划线
zh_hant_hk: 下劃線

# editorToolbarUndo
source: Undo
ja: やり直し
ru: Отменить
zh_hans_cn: 撤销操作
zh_hant_hk: 復原

# footerCC1
source: Unless otherwise stated, all publicly available editorial content on this website is published using
ja: 特に明記されていない限り、このWebサイトで公開されているすべての編集コンテンツは、以下を使用して公開されています：
ru: Если не указано иное, все общедоступные редакционные материалы на этом сайте публикуются с использованием
zh_hans_cn: 除非另有声明，本网站所有公开编辑内容均使用
zh_hant_hk: 除非另有說明，否則本網站上所有公開可用嘅編輯內容均使用

# footerCC2
source: CC BY-NC-SA 4.0 License Terms
ja: CC BY-NC-SA4.0ライセンス条項
ru: Условия лицензии CC BY-NC-SA 4.0
zh_hans_cn: CC BY-NC-SA 4.0 授权条款
zh_hant_hk: CC BY-NC-SA 4.0 授權條款

# guiCancel
source: Cancel
ja: キャンセル
ru: Отмена
zh_hans_cn: 取消
zh_hant_hk: 取消

# guiConfirm
source: Confirm
ja: 確認
ru: Подтвердить
zh_hans_cn: 确认
zh_hant_hk: 確定

# guiCopyright
source: Copyright © RPMTW 2021-2022 Powered by The RPMTW Team.
zh_hans_cn: 版权所有 © RPMTW 2021-2022 由 RPMTW Team 提供支持。
zh_hant_hk: 版權所有 © RPMTW 2021-2022 由 RPMTW Team 提供支援。

# guiDelete
source: Delete
ja: 削除
ru: Удалить
zh_hans_cn: 删除
zh_hant_hk: 刪除

# guiError
source: Error
ja: エラー
ru: Ошибка
zh_hans_cn: 错误
zh_hant_hk: 錯誤

# guiSubmit
source: Submit
ja: 送信
ru: Отправить
zh_hans_cn: 提交
zh_hant_hk: 提交

# guiSuccess
source: Success
ja: 成功
ru: Успех
zh_hans_cn: 成功
zh_hant_hk: 成功

# guiWIP
source: This feature is still under development and is not available at this time, sorry for the inconvenience.
ja: この機能はまだ開発中であり、現時点ではご利用いただけません。ご不便をおかけして申し訳ありません。
ru: Эта функция находится в стадии разработки и в настоящее время недоступна, приносим извинения за неудобства.
zh_hans_cn: 此功能仍在开发中，暂时无法使用，抱歉造成您的困扰。
zh_hant_hk: 此功能仍在開發中，目前不可用，對於畀你帶嚟嘅不便，我哋深表歉意。

# guiWebsite
source: RPMTW Official Website
ja: RPMTW公式Webサイト
ru: Официальный сайт RPMTW
zh_hans_cn: RPMTW 官方网站
zh_hant_hk: RPMTW 官方網站

# guiOptional
source: Optional
ru: Дополнительно
zh_hant_hk: 選項

# guiShare
source: Share
ru: Поделиться
zh_hant_hk: 分享

# guiCopyLink
source: Copy Link
ru: Копировать ссылку
zh_hant_hk: 複製連結

# languageName
source: English (US)
ja: 日本語
ru: русский
uk: український
zh_hans_cn: 简体中文
zh_hant_hk: 繁體中文 (香港)

# modSideClient
source: Client
ja: クライアント
ru: Клиент
zh_hans_cn: 客户端
zh_hant_hk: 客户端

# modSideOptional
source: Optional
ja: 省略可能
ru: Дополнительно
zh_hans_cn: 可选
zh_hant_hk: 可選

# modSideRequire
source: Required
ja: 必須
ru: Требуется
zh_hans_cn: 必装
zh_hant_hk: 必裝

# modSideServer
source: Server
ja: サーバー
ru: Сервер
zh_hans_cn: 服务器
zh_hant_hk: 伺服器

# modSideUnsupported
source: Unsupported
ja: サポートされていません
ru: Неподдерживаемые
zh_hans_cn: 不支持
zh_hant_hk: 不支援

# tabHome
source: Home
ja: ホーム
ru: дом
zh_hans_cn: 首页
zh_hant_hk: 首頁

# tabResourcePack
source: Resource Pack
ja: リソースパック
ru: Ресурсный пакет
zh_hans_cn: 资源包
zh_hant_hk: 資源包

# tabVanilla
source: Vanilla
ja: バニラ
ru: Оригинал
zh_hans_cn: 原版
zh_hant_hk: 原版

# tabWorld
source: World
ja: ワールド
ru: Мир
zh_hans_cn: 地图
zh_hant_hk: 世界

# title
source: RPMTW Minecraft Wiki
zh_hans_cn: RPMTW 我的世界百科
zh_hant_hk: RPMTW Minecraft 百科

# viewModCount
source: View count:
ru: Количество просмотров:
zh_hant_hk: 瀏覽次數：

# viewModSearch
source: Search mods
ru: Поисковые Mods
zh_hant_hk: 搜尋 Mod

# viewModSearchHint
source: Mod name, Mod translation, Mod ID...
ru: Название Mod, перевод Mod, ID Mod...
zh_hant_hk: Mod 名、Mod 翻譯、Mod ID

# viewModTitle
source: Browse mods
ru: Просмотреть Mods
zh_hant_hk: 瀏覽 Mod

# viewModComment
source: Comment
ru: Комментарий
zh_hant_hk: 留言

# viewModCreateAt
source: Creation date
ru: Дата создания
zh_hant_hk: 創建日期

# viewModLastUpdate
source: Last update
ru: Последнее обновление
zh_hant_hk: 上次更新

# viewModCopyUUID
source: Copy UUID
ru: Копирование UUID
zh_hant_hk: 複製UUID

# editModTitle
source: Edit mod
ru: Редактировать Mod
zh_hant_hk: 編輯 Mod

# addModIdField
source: Mod id
ru: mod id（Например, ваш файл mcmod.info в игре имеет id mod）
zh_hans_cn: 模组ID

# addModCreating
source: Please wait, mods are being created...
ja: Modが作成されている間お待ちください...
zh_hans_cn: 请稍候，正在创建模组...

# tabMod
source: Mod
zh_hans_cn: 模组

# tabModpack
source: Modpack
ja: Modパック
zh_hans_cn: 整合包
